#include <stdio.h>
#include <stdlib.h>

int main()
{
    int s1,d1,s2,d2,s3,d3,car,temp;
    int s[3];
    int d[3];
    scanf("%d%d%d%d%d%d",&s1,&d1,&s2,&d2,&s3,&d3);
    s[0]=s1;
    s[1]=s2;
    s[2]=s3;
    d[0]=d1;
    d[1]=d2;
    d[2]=d3;
/*---------------排序，讓s1<s2<s3--------------------------------*/

    for(int i=0;i<3;i++)/*i是要完成的格位，j拿來做比較*/
    {
        for(int j=i;j<3;j++)/*裡面的for迴圈跑完才會跑外面的*/
        {
         if(s[i]>s[j])/*如果指定的格位大於後面格位的數字就做交換，交換後再去找有沒有更小的數字*/
         {/*假設i=1的情況，跑完時第一格的數字是最小的*/
          temp=s[j];
          s[j]=s[i];
          s[i]=temp;
          temp=d[j];
          d[j]=d[i];
          d[i]=temp;
         }
        }
    }
/*---------------計算車的數量¸--------------------------------*/
    car=1;/*一定會有一班車會發車*/
    if(s[1]<d[0])
    {
        car+=1;/*如果s2<d1就要加1班*/
    }
    if(s[2]<d[1])
     {
         car+=1;/*如果s3<d2就要加1班*/
     }
    if(s[2]>=d[0] /*如果第三班的車是第一班的車要減一班*/ && s[1]<d[0]/*前面的狀況，避免出現第二班車可以補的狀況會多減到1班車*/ && s[2]<d[1]/*避免出現第三班車可以同時被前面兩班車替補時的狀況會多減1班車*/)
    {
        car-=1;
    }
    printf("%d",car);
    if(s[1]<d[0]&&s[2]<d[1])
    {
        printf("driver 1%d %d",s[0],d[0]);
        printf("driver 2%d %d",s[1],d[1]);
        printf("driver 3%d %d",s[2],d[2]);
    }
    if(s[1]<d[0]&&s[2]<d[1]&&s[2]>=d[0])
    {
        printf("driver 1%d %d %d %d",s[0],d[0],s[2],d[2]);
        printf("driver 2%d %d",s[1],d[1]);
    }
    
    
    
    }
